src/Catalogs/Scan_СпециальныеУсловия/Scan_СпециальныеУсловия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_СпециальныеУсловия</name>
  <basedOn>Catalog.Scan_СпециальныеУсловия</basedOn>
  <attributes>
    <name>DeliveryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DistributorNet</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FFU</name>
    <type>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>IDПродуктаКП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RUНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SORDER</name>
    <type>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>Дилер</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>ДрайвНеПрименим</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСУSOWA</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПрикрепленныхШасси</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПродуктов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоммерческоеПредложениеSPORT</name>
    <type>
      <types>CatalogRef.Scan_КоммерческиеПредложения</types>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйКлиент</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйКлиентКомпания</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>МаржаДилера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаржаДист</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Scan_МоделиПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКоммерческогоПредложенияSPORT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Обоснование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>CatalogRef.Scan_СпециальныеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрайсCustomerPrice</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрайсDealerNet</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрайсМаржаDealer</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрайсМаржаDist</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродавецДилера</name>
    <type>
      <types>CatalogRef.Scan_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СебестоимостьСНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпецCustomerPrice</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпецDealerNet</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпецМаржаDealer</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпецМаржаDist</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействияСпециальныхУсловий</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.Scan_СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтандартнаяСпецификация</name>
    <type>
      <types>DocumentRef.Scan_СпецификацияСтандартнойМодели</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий</types>
    </type>
  </attributes>
  <attributes>
    <name>СУНаАвтобусы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальностьСпецификации</name>
    <type>
      <types>EnumRef.Scan_ТипыСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаДляДилера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаДляКлиента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаДляКлиентаБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокПродуктов</name>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УсловияОплаты</name>
    <attributes>
      <name>ПроцентОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокОплатыАванса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>EnumRef.Scan_ВидыОплат</types>
      </type>
    </attributes>
    <attributes>
      <name>КрайняяДатаОплаты</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасчетДатыОплаты</name>
      <type>
        <types>EnumRef.Scan_ВидыРасчетаДатыОплаты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Цены</name>
    <attributes>
      <name>ТипЦены</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаржаDist</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DealerNet</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаржаDealer</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CustomerPrice</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстСообщения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>CatalogRef.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>DeliveryDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокДействияСпециальныхУсловий</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПродуктов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/Scan_КомпанииПользователей/Scan_КомпанииПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_КомпанииПользователей</name>
  <attributes>
    <name>ПользовательАвтор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Компания</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/Scan_ТипыСпецификации/Scan_ТипыСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_ТипыСпецификации</name>
  <enumValues>
    <name>Std</name>
  </enumValues>
  <enumValues>
    <name>UO</name>
  </enumValues>
  <enumValues>
    <name>UUO</name>
  </enumValues>
</mdclass:Enum>

src/Enums/Scan_ТипыСоглашенийОПоставке/Scan_ТипыСоглашенийОПоставке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_ТипыСоглашенийОПоставке</name>
  <enumValues>
    <name>ЗаявкаНаСОП</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаСОПSRU</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Scan_СпециальныеУсловия/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	//rarus vikhle 18.08.2020 mt 16181 +++
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Scan_СпециальныеУсловия") Тогда
		DistributorNet = ДанныеЗаполнения.DistributorNet;
		FFU = ДанныеЗаполнения.FFU;
		RUНомер = ДанныеЗаполнения.RUНомер;
		SORDER = ДанныеЗаполнения.SORDER;
		Дилер = ДанныеЗаполнения.Дилер;
		ДрайвНеПрименим = ДанныеЗаполнения.ДрайвНеПрименим;
		КоличествоПродуктов = ДанныеЗаполнения.КоличествоПродуктов;
		КонечныйКлиент = ДанныеЗаполнения.КонечныйКлиент;
		КонечныйКлиентКомпания = ДанныеЗаполнения.КонечныйКлиентКомпания;
		МаржаДилера = ДанныеЗаполнения.МаржаДилера;
		МаржаДист = ДанныеЗаполнения.МаржаДист;
		Модель = ДанныеЗаполнения.Модель;
		Наименование = ДанныеЗаполнения.Наименование;
		НомерКоммерческогоПредложенияSPORT = ДанныеЗаполнения.НомерКоммерческогоПредложенияSPORT;
		Обоснование = ДанныеЗаполнения.Обоснование;
		//ОтсрочкаПлатежа = ДанныеЗаполнения.ОтсрочкаПлатежа; //rarus bonmak 13.01.2021 17041
		ПрайсCustomerPrice = ДанныеЗаполнения.ПрайсCustomerPrice;
		ПрайсDealerNet = ДанныеЗаполнения.ПрайсDealerNet;
		ПрайсМаржаDealer = ДанныеЗаполнения.ПрайсМаржаDealer;
		ПрайсМаржаDist = ДанныеЗаполнения.ПрайсМаржаDist;
		ПродавецДилера = ДанныеЗаполнения.ПродавецДилера;
		СебестоимостьСНДС = ДанныеЗаполнения.СебестоимостьСНДС;
		СпецCustomerPrice = ДанныеЗаполнения.СпецCustomerPrice;
		СпецDealerNet = ДанныеЗаполнения.СпецDealerNet;
		СпецМаржаDealer = ДанныеЗаполнения.СпецМаржаDealer;
		СпецМаржаDist = ДанныеЗаполнения.СпецМаржаDist;
		СрокДействияСпециальныхУсловий = ДанныеЗаполнения.СрокДействияСпециальныхУсловий;
		Основание = ДанныеЗаполнения.Ссылка;
		СтавкаНДС = ДанныеЗаполнения.СтавкаНДС;
		СтандартнаяСпецификация = ДанныеЗаполнения.СтандартнаяСпецификация;
		УникальностьСпецификации = ДанныеЗаполнения.УникальностьСпецификации;
		ЦенаБезНДС = ДанныеЗаполнения.ЦенаБезНДС;
		ЦенаДляДилера = ДанныеЗаполнения.ЦенаДляДилера;
		ЦенаДляКлиента = ДанныеЗаполнения.ЦенаДляКлиента;
	КонецЕсли;
	СтавкаНДС = Справочники.Scan_СтавкиНДС.ОсновнаяСтавкаНДС;
	//rarus vikhle 18.08.2020 mt 16181 ---	
	Статус = Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.Черновик;
	УникальностьСпецификации = Перечисления.Scan_ТипыСпецификации.Std;
	ТипСоглашенияОПоставке = Перечисления.Scan_ТипыСоглашенийОПоставке.ЗаявкаНаСОП;
	Наименование = "СУ ";
		
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	ТаблицаКомпаний = РегистрыСведений.Scan_КомпанииПользователей.ПолучитьКомпаниюДилераПользователя(ТекущийПользователь,Истина);
	Если ТаблицаКомпаний.Количество()>0 Тогда
		Дилер = ТаблицаКомпаний[0].Компания;
		Контрагент = ТаблицаКомпаний[0].Контрагент;
		Наименование = Наименование + Дилер;
	КонецЕсли; 
	
	ПродавецДилера = ТекущийПользователь.КонтактноеЛицоКомпании;
	
	Если ЗначениеЗаполнено(Дилер) Тогда
		РегиональныйМенеджер = Документы.Scan_ЗакреплениеМенеджеровЗаДилерами.ПолучитьЗакрепленногоМенеджера(Дилер);	
	КонецЕсли; 
	
	//rarus ozhnik 15888 29.07.2020 + 
	SORDER	= Справочники.Scan_ОпцииПродуктов.Нет_SOrder;
	FFU		= Справочники.Scan_ОпцииПродуктов.Нет_FFU;
	//rarus ozhnik 15888 29.07.2020 -
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если НЕ ПроверитьСтатусы(ЭтотОбъект.Статус, ЭтотОбъект.DeliveryDate) Тогда
		ВывестиСообщениеПол(Нстр("ru = 'Перед переводом в статус %1 требуется заполнить дату DD (DeliveryDate)'; en = 'Before transferring to status %1, you need to fill in the DD (DeliveryDate) date' "),ЭтотОбъект, "Объект.DeliveryDate",,,ЭтотОбъект.Статус);
		Отказ = Истина;
		Возврат;	
	КонецЕсли;

	
	НаДату = ТекущаяДатаСеанса(); //Rarus bonmak 01.08.2022 18726 АПК было ТекущаяДата()
	Справочники.Scan_СоглашенияОПоставке.ЗаписьЗначенияРегистраСведения(Ссылка, Статус, НаДату); 
	
	//Для каждого СтрокаПродукта Из СписокПродуктов Цикл
	//	Если СтрокаПродукта.Продукт.СоглашениеОПоставке.Пустая() Тогда
	//		ПродуктОбъект = СтрокаПродукта.Продукт.ПолучитьОбъект();
	//		ПродуктОбъект.СоглашениеОПоставке = Ссылка;
	//		ПродуктОбъект.Записать();
	//	КонецЕсли; 		
	//КонецЦикла; 
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	//rarus vikhle 15.09.2020 mt 16181 +++
	Если ЭтоНовый() Тогда
		УстановитьНовыйКод();
		Наименование = Наименование + " / " + "(" + Код + ")"; 
	КонецЕсли;	
	//rarus vikhle 15.09.2020 mt 16181 ---
	
	// rarus tenkam 19.01.2021 mantis 16345 +++
	Если КоличествоПрикрепленныхШасси <> СписокПродуктов.Количество() Тогда
		КоличествоПрикрепленныхШасси = СписокПродуктов.Количество();		
	КонецЕсли;
	// rarus tenkam 19.01.2021 mantis 16345 ---
	
	// rarus tenkam 16.06.2021 mantis 17742 +++
	Если ЗначениеЗаполнено(Модель) Тогда
		СУНаАвтобусы = Справочники.Scan_МоделиПродуктов.ЭтоМодельАвтобуса(Модель);		
	КонецЕсли;                                                                    		
	// rarus tenkam 16.06.2021 mantis 17742 ---
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//rarus vikhle 22.10.2021 m 18441 +++ закомментировал
	//rarus vikhle 06.07.2021 m 17637 +++ Откат, раскомментировал
	//rarus vikhle 08.06.2021 mt 17637 +++
	//rarus vikhle 02.12.2020 mt 16181 +++
	//Если Статус = Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.ОдобреноНетВСОП //rarus vikhle 25.01.2021 mt 16929 
	//	И Статус <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка,"Статус") Тогда
	//	ПроверяемыеРеквизиты.Добавить("СрокДействияСпециальныхУсловий");
	//ИначеЕсли Статус = Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.Запрос Тогда //rarus vikhle 04.02.2021 mt 17196 +-
	//	ПроверяемыеРеквизиты.Добавить("КоличествоПродуктов");
	//КонецЕсли;	
	//rarus vikhle 02.12.2020 mt 16181 ---
	//rarus vikhle 06.07.2021 m 17637 ---
	//rarus vikhle 22.10.2021 m 18441 ---
	
	//rarus vikhle 27.07.2021 m 17637 +++ Раскомментировал
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	//rarus vikhle 22.10.2021 m 18441 +++ закомментировал
	//Если НЕ (Статус = Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.ОдобреноНетВСОП //rarus vikhle 25.01.2021 mt 16929 
	//	И Статус <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка,"Статус")) Тогда
	//	МассивНепроверяемыхРеквизитов.Добавить("СрокДействияСпециальныхУсловий");
	//rarus vikhle 22.10.2021 m 18441 ---
	
	Если НЕ Статус = Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.Запрос Тогда //rarus vikhle 04.02.2021 mt 17196 +-
		МассивНепроверяемыхРеквизитов.Добавить("КоличествоПродуктов");
	КонецЕсли;
	
	Если Статус = Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.Черновик
		ИЛИ Статус = Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.Отменена Тогда
		МассивНепроверяемыхРеквизитов.Добавить("УсловияОплаты");
		МассивНепроверяемыхРеквизитов.Добавить("УсловияОплаты.ВидОплаты");
		МассивНепроверяемыхРеквизитов.Добавить("УсловияОплаты.ПроцентОплаты");
		МассивНепроверяемыхРеквизитов.Добавить("УсловияОплаты.СрокОплатыАванса");
		МассивНепроверяемыхРеквизитов.Добавить("УсловияОплаты.РасчетДатыОплаты");
	КонецЕсли;	
	
	//rarus vikhle 21.10.2021 m 18441 +++
	Если НЕ Статус = Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.Согласование	
		И НЕ Статус = Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.ОдобреноНетВСОП Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СрокДействияСпециальныхУсловий");
	КонецЕсли;	
	//rarus vikhle 21.10.2021 m 18441 ---
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	//rarus vikhle 08.06.2021 mt 17637 ---
	//rarus vikhle 27.07.2021 m 17637 ---
	
КонецПроцедуры

//rarus kabany Дата: 05/07/2021 17943 ++
Функция ПроверитьСтатусы(Статус, DD)
	
	Если Статус = ПредопределенноеЗначение("Справочник.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.Запрос")
		ИЛИ Статус = ПредопределенноеЗначение("Справочник.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.Согласование")
		ИЛИ Статус = ПредопределенноеЗначение("Справочник.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.Одобрено") 		
		ИЛИ Статус = ПредопределенноеЗначение("Справочник.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.ОдобреноНетВСОП") ТОГДА  //rarus kabany Дата: 05/07/2021 17943 +
		
		Если НЕ ЗначениеЗаполнено(DD) Тогда			
			Возврат Ложь; 		
		КонецЕсли;		
		
	КонецЕсли;

	Возврат Истина;
КонецФункции
//rarus kabany Дата: 05/07/2021 17943 --
